#### Terraform Plan

```hcl
data.archive_file.gcp_placeholder: Reading...
data.archive_file.lambda_placeholder: Reading...
data.archive_file.lambda_placeholder: Read complete after 0s [id=0c17fde5402bda594832e82dfb765ac178827999]
data.archive_file.gcp_placeholder: Read complete after 0s [id=cb7c5d4bc441555c9b0d6001d9f41f20dd9c07e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.lambda_execution will be created
  + resource "aws_iam_role" "lambda_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crossping-lambda-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "crossping-lambda-execution"
    }

  # aws_lambda_function.ping_ap_northeast_1 will be created
  + resource "aws_lambda_function" "ping_ap_northeast_1" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./placeholder.zip"
      + function_name                  = "crossping-ping"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "cNs8wwh+ZdCV6R53I+L4hfqSeQXZ5ZM8sScicKp7y6I="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # aws_lambda_function.ping_eu_west_1 will be created
  + resource "aws_lambda_function" "ping_eu_west_1" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./placeholder.zip"
      + function_name                  = "crossping-ping"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "cNs8wwh+ZdCV6R53I+L4hfqSeQXZ5ZM8sScicKp7y6I="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # aws_lambda_function.ping_us_east_1 will be created
  + resource "aws_lambda_function" "ping_us_east_1" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./placeholder.zip"
      + function_name                  = "crossping-ping"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "cNs8wwh+ZdCV6R53I+L4hfqSeQXZ5ZM8sScicKp7y6I="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # aws_lambda_function_url.ping_ap_northeast_1 will be created
  + resource "aws_lambda_function_url" "ping_ap_northeast_1" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "crossping-ping"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)

      + cors {
          + allow_headers = [
              + "*",
            ]
          + allow_methods = [
              + "GET",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # aws_lambda_function_url.ping_eu_west_1 will be created
  + resource "aws_lambda_function_url" "ping_eu_west_1" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "crossping-ping"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)

      + cors {
          + allow_headers = [
              + "*",
            ]
          + allow_methods = [
              + "GET",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # aws_lambda_function_url.ping_us_east_1 will be created
  + resource "aws_lambda_function_url" "ping_us_east_1" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "crossping-ping"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)

      + cors {
          + allow_headers = [
              + "*",
            ]
          + allow_methods = [
              + "GET",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_lambda_urls       = {
      + ap-northeast-1 = (known after apply)
      + eu-west-1      = (known after apply)
      + us-east-1      = (known after apply)
    }
  + azure_function_urls   = {}
  + cloudflare_worker_url = "https://crossping-ping.workers.dev"

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/azurerm"],
  on providers.tf line 25, in provider "azurerm":
  25:   skip_provider_registration = true

This property is deprecated and will be removed in v5.0 of the AzureRM
provider. Please use the `resource_provider_registrations` property instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/azurerm"],
  on providers.tf line 25, in provider "azurerm":
  25:   skip_provider_registration = true

This property is deprecated and will be removed in v5.0 of the AzureRM
provider. Please use the `resource_provider_registrations` property instead.

(and one more similar warning elsewhere)

Error: expected a non-empty string

  with provider["registry.terraform.io/hashicorp/google"],
  on providers.tf line 18, in provider "google":
  18: provider "google" {

project was set to ``

Error: expected a non-empty string

  with provider["registry.terraform.io/hashicorp/google"],
  on providers.tf line 19, in provider "google":
  19:   project = var.gcp_project_id


Error: Invalid Attribute Value Match

  with provider["registry.terraform.io/cloudflare/cloudflare"],
  on providers.tf line 30, in provider "cloudflare":
  30:   api_token = var.cloudflare_api_token

Attribute api_token API tokens must be 40 characters long and only contain
characters a-z, A-Z, 0-9, hyphens and underscores, got:
db02a54282e7cbae99617805c3ce4a19d9bb3
::error::Terraform exited with code 1.

```

*Pushed by: @volstas*